::---------------------------------修改日志-----------------------------------
::2014-10-24 13:45:13  文件创建
::----------------------------------------------------------------------------
@echo off
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
::内网地址，客户端请求WCF服务
set db=localhost
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
::内网地址，用于客户端更新时间
set uid=sa
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
::内网地址，用于客户端下载更新文件 
set pwd=123456
echo ┌──────────────────────┐
echo │                                            │
echo │       欢迎使用品杰科技数据库安装工具       │
echo │               V1.1(2014-10-31)             │
echo │                                            │
echo └──────────────────────┘
:PrintConfigInfo
echo ****************************************
echo 请确认配置：                       
echo 1. 数据库地址为：%db%        
echo 2. 账号为：%uid%   
echo 3. 密码为：%pwd%
echo ****************************************
set /p changeconfig=是否修改（Y/N）:
if not "%changeconfig%"=="Y" goto setup
set /p db=请输入数据库服务器:
set /p uid=请输入登录名:
set /p pwd=请输入登录密码:
goto PrintConfigInfo
:setup
echo 开始安装
sqlcmd -S %db% -U %uid% -P %pwd% -d master -i Scripts.sql -b
pause